; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon7 spectrograph4)
	(have_image Star8 spectrograph3)
	(have_image Planet9 spectrograph4)
	(have_image Phenomenon10 spectrograph3)
	(have_image Phenomenon11 spectrograph3)
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph2)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 spectrograph4)
	(have_image Star17 thermograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
2. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 12
3. (turn_to satellite0 star17 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star17)
   goals met: 0 of 12
4. (take_image satellite0 star17 instrument1 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 1 of 12
5. (turn_to satellite0 planet15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet15)
   goals met: 1 of 12
6. (take_image satellite0 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 2 of 12
7. (turn_to satellite0 phenomenon14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 12
8. (take_image satellite0 phenomenon14 instrument1 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 3 of 12
9. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 4 of 12
11. (turn_to satellite0 groundstation2 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 12
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 12
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 12
15. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 12
16. (take_image satellite0 phenomenon10 instrument0 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 5 of 12
17. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 12
18. (take_image satellite0 phenomenon11 instrument0 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 6 of 12
19. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 6 of 12
20. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 7 of 12
21. (turn_to satellite0 phenomenon16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon16)
   goals met: 7 of 12
22. (take_image satellite0 phenomenon16 instrument0 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 8 of 12
23. (turn_to satellite0 phenomenon6 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon6)
   goals met: 8 of 12
24. (take_image satellite0 phenomenon6 instrument0 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 9 of 12
25. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 9 of 12
26. (take_image satellite0 phenomenon7 instrument0 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 10 of 12
27. (turn_to satellite0 planet9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet9)
   goals met: 10 of 12
28. (take_image satellite0 planet9 instrument0 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 11 of 12
29. (turn_to satellite0 star8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
30. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 12 of 12
